%========================================================================================================================%
%                                             common_all_near_zero.m                                                     %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  李倍存 创建于 2015-10-23 10:38。电邮 li.beicun@foxmail.com。                                                          %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  (C) 版权所有 2015- ，李倍存及iPso。                                                                                   %
%  对该文件所包含的代码的正确性、执行效率等任何方面不作任何保证。                                                        %
%  任何个人和组织均可不受约束地将该文件所包含的代码用于非商业用途。                                                      %
%  若需要将其用于商业软件的开发，请首先联系所有者以取得许可。                                                            %
%========================================================================================================================%
function isNearZero = common_all_near_zero(vector, precision)

    isNearZero = 1;
    n = size(vector);
    i = n(1);
    j = n(2);

    for i_ = 1:i
        for j_ = 1:j
            if abs(vector(i_,j_)) > precision
                isNearZero = 0;
                return;
            end
        end
    end