%========================================================================================================================%
%                                                pf_build_node_datas.m                                                   %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  李倍存 创建于 2015-10-23 10:10。电邮 li.beicun@foxmail.com。                                                          %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  (C) 版权所有 2015- ，李倍存及iPso。                                                                                   %
%  对该文件所包含的代码的正确性、执行效率等任何方面不作任何保证。                                                        %
%  任何个人和组织均可不受约束地将该文件所包含的代码用于非商业用途。                                                      %
%  若需要将其用于商业软件的开发，请首先联系所有者以取得许可。                                                            %
%========================================================================================================================%
function [U,fy,S,UExceedUprNodes,UExceedLwrNodes] = pf_build_node_datas(fe,Y,N)
e = fe(N+1:N+N,1);
f = fe(1:N,1);

U1 = e+f*i;
U = abs(U1);
fy = angle(U1);
G = real(Y);
B = imag(Y);

tmp1 = G*e-B*f;
tmp2 = G*f+B*e;

P = diag(e)*tmp1 + diag(f)*tmp2;
Q = diag(f)*tmp1 - diag(e)*tmp2;

S = P + Q*i;
t = angle(S);

UExceedUprNodes = zeros(N,1);
UExceedLwrNodes = zeros(N,1);

for j = 1:N
    if (U(j)>1.1)
        UExceedUprNodes(j) = 1;
    elseif (U(j)<0.9)
        UExceedLwrNodes(j) = 1;
    end
end