%========================================================================================================================%
%                                                 pf_calc_delta.m                                                        %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  李倍存 创建于 2015-10-21 10:12。电邮 li.beicun@foxmail.com。                                                          %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  (C) 版权所有 2015- ，李倍存及iPso。                                                                                   %
%  对该文件所包含的代码的正确性、执行效率等任何方面不作任何保证。                                                        %
%  任何个人和组织均可不受约束地将该文件所包含的代码用于非商业用途。                                                      %
%  若需要将其用于商业软件的开发，请首先联系所有者以取得许可。                                                            %
%========================================================================================================================%
function delta = pf_calc_delta(N,PQNodes,PVNodes,BLNodes,P,QAndU2,Y,fe)
    
    [e,f] = pf_dicompose_fe(N,fe);

    nodeNbrOfBL = BLNodes(1,1);
    [G,B] = pf_dicompose_ri(Y);

    deltaP = P - (e.*(G*e - B*f)) - (f.*(G*f + B*e));
    deltaQ = QAndU2 - (f.*(G*e - B*f)) + (e.*(G*f + B*e));


    deltaP(nodeNbrOfBL) = 0.0000;
    deltaQ(nodeNbrOfBL) = 0.0000;

    PVNbr = size(PVNodes);
    for i = 1:PVNbr(1)
        index = PVNodes(i);
        deltaQ(index) = QAndU2(index) - (e(index)*e(index)+f(index)*f(index));
    end


    delta = [deltaP;deltaQ;];