%========================================================================================================================%
%                                                pf_optimal_multiplier.m                                                 %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  李倍存 创建于 2015-10-25 13:45。电邮 li.beicun@foxmail.com。                                                          %
%________________________________________________________________________________________________________________________%
%                                                                                                                        %
%  (C) 版权所有 2015- ，李倍存及iPso。                                                                                   %
%  对该文件所包含的代码的正确性、执行效率等任何方面不作任何保证。                                                        %
%  任何个人和组织均可不受约束地将该文件所包含的代码用于非商业用途。                                                      %
%  若需要将其用于商业软件的开发，请首先联系所有者以取得许可。                                                            %
%========================================================================================================================%
function om = pf_optimal_multiplier(y0, delta)
    multiplier_a = y0;
    multiplier_b = -multiplier_a;
    multiplier_c = y0 + delta;
    g0 = (multiplier_a') * (multiplier_b);
    g1 = (multiplier_b') * (multiplier_b) + 2*(multiplier_a') * (multiplier_c);
    g2 = 3 * ((multiplier_b') * (multiplier_c));
    g3 = 2 * ((multiplier_c') * (multiplier_c));
    
    mus = roots([g3 g2 g1 g0]);
    mu = mus(mus == real(mus));
    om = mu(1);

    om = 1;